#pragma once

// Satisfactory (V0.103) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SF_Anim_1p_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Anim_1p.Anim_1p_C
// 0x12356 (0x12806 - 0x04B0)
class UAnim_1p_C : public UFGAnimPlayer
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x04B0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8BBA0DA44A61CBF3D2B4EBA21D3CB1F6;// 0x04B8(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98FBC23F4C9A713C0FB93D9AD6EEE9B4;// 0x0598(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41486603465DA2EE45A05285737B6F37;// 0x05E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72A79E6D45404B548CB614A287C4B26C;// 0x0628(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5039F38743640F2D676C48BFB75282A9;// 0x0670(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE2D69DD4977FC45382F1EA75A0059DA;// 0x06B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_650862FA4B1F7229923D688CA2759DEF;// 0x0700(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8110100E44167500A9386FBBC4AF4756;// 0x0748(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29E470814ED65B9558A8DEA14BC39066;// 0x0790(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E06F5E1B412E03A618C8DA9390B5A2D4;// 0x07D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AB9574D497C4152E7E0B29DC8D7EDCA;// 0x0820(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B17FCA464B6FA53AE37EC1921486EDD1;// 0x0868(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F948AAE7488B4C18BC7BD3995671074F;// 0x08B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51B03D77497B352DA91F9280A6878691;// 0x08F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B22AF35D4BCF08D326922D9EED21F2CB;// 0x0940(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D6C0685E408BBFC5EDB85DB32257F453;// 0x0988(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_52119FBA49F8E0F4A06BE8ACC87B8ACF;// 0x0AB0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_50967A16404DBB09894D7DA0602D06F6;// 0x0AF8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7EAC83C34C96A77B8CE3B4997B73DE9C;// 0x0BD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A19915A642CEA8B6DC0F6B8E41B879A4;// 0x0C20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_587BA1204446F40C606E288070A55BF8;// 0x0CD0(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A72EFCEB4FB0E6C451891FA9AE2361BE;// 0x0D80(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6FB87DDA45FAD483801302B7D3ED1C46;// 0x0E60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B51ECD554EBEAA64F87216BDCD22B6BB;// 0x0F10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A845D3574A4B1D8203B76AAE6AF4A882;// 0x0FC0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56E61D474423534A946495AA03F2E8E7;// 0x1070(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01E8C3B74C716D48EC32558293F72BC0;// 0x1120(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D6C366BA4FC8B77F9E3DCBADF9C939E0;// 0x11D0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A4BB2404FF100ECECB1CD9205E8DA09;// 0x1280(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2AA58B54E2F840C9459CAB5865F6B99;// 0x1330(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF48C04B4372126E3552D7B0D7495ACF;// 0x13E0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_410E9078418FCD0E4BDC26B8FCE702F1;// 0x1490(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6BFECA254FD78B30A2E0938819D54A2D;// 0x1540(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F63D8814D03208D6BBAA29EF891D7F8;// 0x1588(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10B1324041E8974CD639CB91EA071499;// 0x15D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8741F1A4423A331D860F629FE6A60CB3;// 0x1618(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2025F2404EA061FA9D9697A9B542D25B;// 0x1660(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40E3382B4B538B1FC5BACDB687986EDB;// 0x16A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EAA692B4875136C0123118C321CE9BC;// 0x16F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F3D2C6646223988B4B8CF9C40EF52CF;// 0x1738(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F088D9849F7BB96258384A8FA66C903;// 0x1780(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B7A325746C172AE5C0B46B794AE5F3B;// 0x17C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D808172241800287216930AE9593BA4A;// 0x1810(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F57A916D4093B05B062C5D88F7A1F76C;// 0x18C0(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_CC1A2B1945E10B7B29887BAF4DD28125;// 0x1970(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_75249F4C441493A5B0EFE8B397718C69;// 0x1A50(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9F22F03345F67763997E868D9C757C61;// 0x1B00(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6374867541DF67E1F9308693BD6BD12D;// 0x1BB0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5AE521B14D9254220E9ABEAC1578072C;// 0x1C60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_133618EF4E80C919A8AC96A566312470;// 0x1D10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E6C588B4DB316CF2E7148B5FEB44990;// 0x1DC0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_127AF8C6418D7082037D3CA83749D9EA;// 0x1E70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04FEEAD74CC24D0FFBE9BD8FD827141E;// 0x1F20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A17BBA654536D20531CE75A107C47E05;// 0x1FD0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7EC8072644CCD538327DE4877C551D08;// 0x2080(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04B4F2814D1E638EA5E99091863C7CE9;// 0x2130(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_B17FC0554FA5ABC82756049CB84018EC;// 0x2178(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5BC54B2B467EA2FB1B1DA8BE42FD1B21;// 0x21B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A46283A4F4A377E680F859A46D874AA;// 0x21F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC261AB34898DDE487D743AEBC5D54EE;// 0x22A8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_010814574EB7E8DD9F31E2A003FB0708;// 0x2358(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8301669F4CD42169BAE729A945519657;// 0x2408(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4BF4BEA48DCB9B1D813F39CC02C5348;// 0x24B8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B78154543C4F7B1841090916A6C242A;// 0x2568(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36634ED24207FA78031D68ACCBDE036D;// 0x2618(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FE408E8C47A8E28AAE6254878554FF5F;// 0x26C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7020AF874CD885A7D7F43A8B5D8808EC;// 0x2778(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3F8DCFF747E0C17AED3D71BEBB07B4E7;// 0x2828(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF0E857B4549A4BA6B78EDB76D338BAA;// 0x28D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D02B38974AF58A6BBE66288CF0AF54BD;// 0x2988(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F3F23A7D4725B4CD568ADF9A00250B44;// 0x2A38(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C5111DB43B18719FA4774ABAA6DE00E;// 0x2B18(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6E244A9D44FC15B17498D9BB01211FE4;// 0x2B60(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1A59E2DB4793058EFF6EF6B6E652AE42;// 0x2C30(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D94EAA2F46D683AE9C974788D63F1E32;// 0x2D10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F7623F0480EC967991920A7A71C3A5B;// 0x2DC0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_088B7D584B0B84B4EB98978859751C5B;// 0x2E70(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD41A3DB46DD3E77FF80E49DAB4A72B3;// 0x2F98(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A1CE608472218B6F699BEA183E3D3A2;// 0x3048(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_022B8DE34B3FC4594010C9B1D49C727E;// 0x30F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7AAFCC66439DC6AD2C9AEAA1EA0D12EB;// 0x31A8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A37CAFF47DB392A73DFA293D99BDBA6;// 0x3258(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBE678F44B9907AEFA3EF68AF15C5CEF;// 0x3308(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B91CF490421BAD9F976F7E8B1F4C121D;// 0x33B8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_75C0015442395AC3E20D40AF3EB74BD5;// 0x3468(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EC6F6D1492D469C48A2CBA6124BB1B7;// 0x3518(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB427931418C81AFA995D4BDA5AC0B4E;// 0x35C8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_318F0D3D47E0C7F43206C28692F71D26;// 0x3678(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C63F7D104AA339BFE6137B9E096F829F;// 0x36C0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FE435104652128B4DED769540DF2669;// 0x3770(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C8A0CDDE449DD5FE7DE5ADAE8672235E;// 0x3820(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B9B84ACC46A3459ACB63ED94830AE951;// 0x3900(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F202681348D55868ADF4BF99B2A044E7;// 0x39B0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3B387A9B4CC5113A8AB1B287631800A5;// 0x3A60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67C08E37417201C76AF9F5BC4C6404FD;// 0x3B10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0DEDFEF64953B86B4E0BFCA8614ABC46;// 0x3BC0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3186CECD48244E4949BF4D8E895A135A;// 0x3C70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_162B1C75446468F34BB35F848C9A62A2;// 0x3D20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C56FDE1546A47F8746F7239CC2FCB986;// 0x3DD0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22BB9F974F7052BC62870591A0F2CD9B;// 0x3E80(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD3199414EB1F822885A1BA4FEEA3B7B;// 0x3F30(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_30D74AC44460B8B62CF376A17421BC0A;// 0x3FE0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3598F28B420EA7C518CEDDAF3222039C;// 0x4028(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D42E71034A8BF7F6E9CB67982B2040AB;// 0x4108(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAFC295140982C1AE6B3448C333C7A68;// 0x4150(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD0BD6BD41CB1D9FFCE1D9BA49984BE9;// 0x4198(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_718AF9734FAD904546F3D9AD33140564;// 0x41E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AACAA52D49A3AA8F307990A1AAAEE275;// 0x4228(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_200748904D648F095E8D7081C7D7E311;// 0x4270(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2070F6E4CA79E0B77A729B8056DBF50;// 0x42B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_485ACC644FE59DD1953D1C949B574894;// 0x4300(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C430D2D45AFC02D733E23A8FB7B20E2;// 0x4348(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1D0BC5E40C38AB7A05E3D8D185A67C8;// 0x4390(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E1E9821B46DC716C72E69FA563D29D91;// 0x43D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC46938845A596DE301BAAAC9CB5F40E;// 0x4488(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_809757B045E612E00143D5B5D031E085;// 0x4538(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DEB7D5B04A446468EAE72D8637CBCFAF;// 0x45E8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1441EDC043067240DD33A69947A13821;// 0x4698(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E4290A8F428CD9F255776898A40B67CC;// 0x4748(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00C79359481A1EFA748F13897F59F5D6;// 0x47F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7309B6D49E7B3A8F68216968C0CD90C;// 0x48A8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3B66EE1C407FE87B139D34B4778A1006;// 0x4958(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CE708DC4D8080916A39309B82B7110D;// 0x4A08(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_575B095A4B4AFEE0DB448BB769CAF7D6;// 0x4AB8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B055CF2144AFC56CC86AA0AFCBD3C4B1;// 0x4B98(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_08A98FC84D862A3ED8E484B15DB79D14;// 0x4C48(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F02C261340207F527AC5DAB895097DCF;// 0x4D70(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7A8BB8044DC0F9EC9F33CA8DF7803845;// 0x4DB8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6F0021C443F683F84029D796FF721C24;// 0x4E98(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_47212A674AF9396062AD7EB30C796A6E;// 0x4F48(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6B8959F1411EE629F76D929645BA68FA;// 0x4FF8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_778B8CFA4588AEE4D1C044B21950374C;// 0x50C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_58065DCB48651079F7DC23A3F877AFC3;// 0x5178(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5E3E088D4DBD66AF0E79CD93C53E2344;// 0x5228(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22A591F34BD7E880502DFAA83F80EA97;// 0x52F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91C75CEE409C8A8F5C47678E33CB72A6;// 0x53A8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FC15D9B94278E36EDE1BCF8479C9F89C;// 0x5458(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_234404AA493FA4B99B99959E1915BE60;// 0x5528(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0BF1B2D4E14E08A237EC58F05ABF90C;// 0x55D8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3AD77E03498CE00667C58CA5CC0345E2;// 0x56A8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C201C89F4FF362F861C1FA9AAB9DE7CE;// 0x5758(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE895984497BE1233EC63EAE327843A3;// 0x5828(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B775E3749D528C8DEC97AAD36E72F2B;// 0x58D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE909C084FAEBE2F4D25A6B623A5FD30;// 0x5988(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6672D63C40D1E6EC3F204D883C306029;// 0x5A38(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B7205EA43041A24E5EACF8A5A09E6BA;// 0x5B08(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_44C598054328748E388D148494B2F738;// 0x5BB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD3E7CB442E7DE3D28500282F1202E14;// 0x5C88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03DFE33947D4DD185E7955BA6487E963;// 0x5D38(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B63E2CE845CF551F8769E7B1288F9250;// 0x5DE8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_885E0A5B433ECD29F09A71A7B71D31BF;// 0x5EB8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C694115540BE15A628D14C8195A5A129;// 0x5F68(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9791916E4947BB233816B2A1BEE9C86D;// 0x6018(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_354509A441FA2BE760BEF8A9F65F77BF;// 0x60C8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C48152554428A444E554BE997E9B090C;// 0x6178(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_77F935D54EF242E86CE6798D52A9FEE2;// 0x6248(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B93BB639401B333A27925AA45EA4AC02;// 0x62F8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8552BC1A4363A53DF9BBD3A5AAD1CE87;// 0x63A8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C4302A564DD4DC47986961B310548E0E;// 0x6478(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88438351458F07FA17B269B3E8107ED3;// 0x65A0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_12CA6B404969F07201205EBE48FCBC18;// 0x6650(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1C506563437EE93E4A008BAB7C81CAB1;// 0x6720(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BA77F76D4423368082F3EF89AEBC8A4A;// 0x6848(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9A29840E4DF86CAED998D79665BE7144;// 0x6970(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_332B5E8F4742D7B2F303829EC967102A;// 0x6A40(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_682EE13E4C162D8A18D84D87844B36A8;// 0x6A88(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D48A4A2C447ADA994290E7AB0A22083F;// 0x6B68(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_818A4537472878DF467D56B718DA4156;// 0x6C18(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_282EFCAB487AB07846E75CBA4712EAE7;// 0x6CC8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4F2C05443DCEE2A47F3B7A510B4080A;// 0x6D78(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F14A73A042B539206B7A65B93E1DF58B;// 0x6E28(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E302200E48406DE25E337DB5726D800A;// 0x6ED8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F736B75443EA79490ACB18A7DFB2EC42;// 0x6F88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD4A67D44C51002C9ABFB0815D480CD8;// 0x7038(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBEA0CCE48F07EBC6E6025800FEDA7C7;// 0x70E8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E36F45A54F1065910C8DAFAE5BCC534D;// 0x7198(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70C791E744BAB9D25CA859A997E03FB1;// 0x7248(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4BB10171424F09F42F994A9CB73B009B;// 0x72F8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0B7679284E58F16E108FE18553ED91FC;// 0x7420(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0722D98242855A2D2D61D0A31E0D4056;// 0x7468(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B1FB286A4B9F335B00679DB9659E6B59;// 0x7548(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA87E8294D8EABDC183F65BF5E749D1E;// 0x7590(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC1797A944CBA36012F80BAE3C5CE5CC;// 0x75D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FEC73CD415CE6EA644F3A86A8396318;// 0x7620(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DA8A992420A431E9924B2ADBE3EEC11;// 0x7668(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C290BA2642DAC287EAEB10B8358EC88C;// 0x76B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F7DB4CD4B106D52E249CA964AD89CDA;// 0x76F8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D725CE99432C6CF2E288D9B8906BBEBC;// 0x77A8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_771A12434699643C42C0DABE8F421866;// 0x7878(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_464AB3C9415C184B09EB44BA50857733;// 0x7928(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F55B2EB64B417CDAA78E2DBE017B3A00;// 0x7970(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BDE5869459B5D0EB1A1E58191B760CF;// 0x7A20(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7215F8D6436EE5EA4DC3DF831ECDB30A;// 0x7AD0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A646955440CC8774B86A48A7A726A613;// 0x7BB0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E0CD79314CC35BBC65F9368EE6A74114;// 0x7C60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE5757814F8EE9A8FD7229B65D2D4C34;// 0x7D10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_558E1EB348CFC6DF00CFAF9B154D6E96;// 0x7DC0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E23B48994B5CD821090A0386381667F4;// 0x7E70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED375D2B44F4AA27EEA9ACB95E1FF937;// 0x7F20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B237CEE140B9A61A18BF78A80D960769;// 0x7FD0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C25874C4B46939DE0278AA4CAAAADA3;// 0x8080(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A3C9B73B4DE7B5B327D25899F1775565;// 0x8130(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8C59E95B4687323C83CCFE860D76B660;// 0x81E0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39043B534762A5B7D510FCB77D892B95;// 0x8308(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8A89B11646C0EABB4DB11C99E7E7A5CE;// 0x8350(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_77CB344E4488111A8431118F0AC4DED6;// 0x8430(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_736042B54C164CD62B768D85C709AB9B;// 0x84A0(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E05DA50D41F92DC0CA4EE991528E547C;// 0x85C0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91AE2AAF4753A73ABDD783B4D61FB54A;// 0x8670(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE1FFFD04063214935B694B5D003C60E;// 0x8720(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_36136B9F4AFE69173E5D7D9663485094;// 0x8790(0x0120)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4239456C4F154383E0EAA49D54F86EF9;// 0x88B0(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_89B5BE124FF672B91B170384C3FA877F;// 0x8920(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28D29C01444EF58C9C780BAE9960F115;// 0x8A40(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A01AE8D0402533CCC2D1E28C6147D69E;// 0x8AF0(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_9777CE794589C65648A6EF9AC2C5AF74;// 0x8B60(0x0120)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_19751AD04FEC6030DBE51DBFDE698B80;// 0x8C80(0x0120)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4538F6FC44F18A8501ABD881113EB9B4;// 0x8DA0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45C1A2CB4AF4DEA53B6EA7B2F28BAAAD;// 0x8E10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AE7013CE44A08C408857B2977BBAA5E2;// 0x8EC0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D3E14E5C48B517FE2A69EF830903C65C;// 0x8F70(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_1B77C1554F00FA6AA0B604B6261581FC;// 0x9098(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1995AEE6405E24BB634D27BEF2AF6ABD;// 0x91B8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D82A84B04E985746022E8C88AD031020;// 0x9268(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_B1C753374569B0C7C906B687660378C6;// 0x9390(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F28EAE0841F00DCD9065BB83E7D13F69;// 0x94B0(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_95E1C1244D6CA6A328A9E6AB27CBFCBA;// 0x9560(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_647BB0FA4069DD3187495A9CA3E6D87D;// 0x9680(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CEC17F9412462C50D56D98D47BEA900;// 0x97A8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_660C335F438714D2C40AA7888BE025F1;// 0x9858(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_86FCE35D4A41394495C010A20BB5CEB3;// 0x9908(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_B38CCCC94809907F50065A82646B5E51;// 0x99B8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ED3671964B12724D60FAB081ABAA50AA;// 0x9AD8(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_C12460A74A252615D4D771BD2340C913;// 0x9C00(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23C058854583D125562B20B8C008BC50;// 0x9D20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87DFD70A4929078C36A6749D787B9F49;// 0x9DD0(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_A3E8EA3D4B613571BB62A09AD7CF7D6B;// 0x9E80(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_46ED49AF4B064B2DE42606BE830EB429;// 0x9FA0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0E303FF7496532240F58A8BC436CBE6E;// 0xA0C8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BDFB0A294D805E7CBF0C6CB6E8343C83;// 0xA178(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_6874A4104ED66E6003A0C49F09F29809;// 0xA2A0(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_49C9E62849764CBCD3A7AEB2E50B93C4;// 0xA3C0(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_24166CE34966243A9EE5379F179A89F5;// 0xA408(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8EF7B3654EDFFCC2EE6D4EB0E7759DF6;// 0xA4E8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9CB2E2B941B7BCBBA0309498C65293EB;// 0xA598(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85AD357441C233689334F586BF77EFF6;// 0xA668(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2948DE004EFCA37075E1EAACAEAD6B62;// 0xA718(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC0F5E09494AA110C06F1AB274C256AD;// 0xA7C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0BD718841CF6CC44C0388ACB6A79223;// 0xA878(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBF61786417D1D14B836FDA38A863D99;// 0xA928(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_95372D9D40A622860920B3B010146442;// 0xA9D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1817F28C4A5A122EB5CF0C9F09B3F53D;// 0xAA88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0214CB374AB958525D3C1E9A2C22EFC6;// 0xAB38(0x00B0)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_CF1B805D4BF74221DF04F4B41B77F8BA;// 0xABE8(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4D654594923E7BBFEA089BAB541C5F3;// 0xAC78(0x00B0)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_5ADD4BC84AC694A1D804F19686899C69;// 0xAD28(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B2CC9607486CC7E44D687A8AE2AEDBEC;// 0xADB8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6E99F03E457586DB3E6828BA04C04481;// 0xAE68(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B719B127411201A1A95AD08B389599AF;// 0xAEB0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD05AE0F4C34C89F88AE49B356ECFDAE;// 0xAF90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_615E755E4261BD12A5AD13AC20DDFC4F;// 0xAFD8(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5C7F9E76475E48F0C2A7B98B5D1B8EB3;// 0xB0B8(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0CF8555244085B2D4901C6AAC7B27DF9;// 0xB108(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B0C4631C43FC5354F954B4892AD87873;      // 0xB150(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3B6C1F9545FAA9349FAC63B07B323E65;// 0xB1C0(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_B10527FA4E79758B0AD662BFC79B5399;// 0xB2A0(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_20AE03E841B764DA688DBC800E0E173B;// 0xB380(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1ADE49214B802D035A72B186C98E9BE5;// 0xB460(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AF73FB33489796357D883FA0F7CDAACB;// 0xB4B0(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_596765604E98902DBCE429B4FCCC2251;// 0xB610(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4336EE314C5FF29C3AD41B9204AE9A28;// 0xB658(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F95E3A7042EA478114E25196CE759CE4;// 0xB6A0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_480E0C0B4B1E8FD58772D393DEECB7FB;// 0xB780(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A713AD1E4A7021921E8444B5058BD5CC;// 0xB7D0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B69A70CA460C6239D2E83781D7305302;// 0xB820(0x00D0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DB43FBD541FCA6487986C0B5A4E24AF7;// 0xB8F0(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C5242A304FC02BBC1919B8998A6686B0;// 0xBA50(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A0520A1F49D79A2F4EB0579F3F40EAFB;// 0xBA98(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_19313FA84A6353DA22CE23AB6CC9FED6;// 0xBAE0(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ADFA862244E0B3BDF75A99ADCA4B2B69;// 0xBBB0(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_22E3DA9A4B34965C23A4A1A949D72DA9;// 0xBC00(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C94DC43D487A8B943D92A68654EB8696;// 0xBD60(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_935A58004094A05772E90E93A378A31A;// 0xBDA8(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2E1677EF4A478528E3E1D4ACCD15357F;// 0xBDF0(0x0200)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0FFFCB2941AC292487D2DDB428C829A5;// 0xBFF0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_396CD3444F449F3C0294CEB5C5B9723D;// 0xC0D0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CBF84E5748FD1E9355FA0EA1F89E5C7C;// 0xC120(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_A0F96F9F430476DE4227E894FE84C362;// 0xC170(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38B1002F44F325CCD9873BA04F2C6FA4;// 0xC370(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_810D95F34E3305277FB36FB489D2E7BB;// 0xC3C0(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7093652E43AD9EB549F24DA856209B0F;// 0xC490(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_63CD46E0404D303FABCAD8A3E2DC70BE;// 0xC4E0(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6F5E695949CC7BFAA08F1BA26699BEC0;// 0xC6E0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4F4D47F44434EBD5B7276EAEC38E4DAF;// 0xC730(0x00D0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DF50F8E44024C35D6532658082CE8B82;// 0xC800(0x0160)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_32415A7946EBE770095DB69A016CD80C;// 0xC960(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A11652F84A7EFCF1997E68B9AE044F26;// 0xC9A8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ABDFB42F4907610C132DE789785B5B3A;// 0xC9F0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_166AF49C431F8DA6AD2AF08C763B8DAA;// 0xCA40(0x0050)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_CB2B612644702D31391D369891535852; // 0xCA90(0x0270)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9EB2D081453F8CBD09F253AE65D59507;// 0xCD00(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B1FD48304B3A6F37B85D5BBDDD8EA492;// 0xCDD0(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C4F0A7B74431A18FF535AA9B06306886;// 0xCEB0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_693D69EE416DEF2C2AC4A6905EDAD6BC;// 0xCEF8(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_10C4469B4BB88A57AA7319820EDA1C52;      // 0xCF48(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2D3F2882439C6D0B1AF3249DDD0782CB;// 0xCFB8(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_22C714314075880F26769E8475B8A62E;// 0xD098(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_B47EEA42455A1085849AF8AEDDBFCEFA;// 0xD0E8(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_330D3619416CEAE55A4BC8B82A3F56D9;// 0xD2E8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A3B43656403E56D7486798986D0CE703;// 0xD338(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_30E0A1474C6911530E0277A5FDE5F501;// 0xD388(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3A339BD04071E908CF80FEA47B77FE46;// 0xD3D8(0x0200)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3F54C6DE44F1276530BC48BDE6DD5942;// 0xD5D8(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8D396F944DF76A328C2621ACDBA0194B;// 0xD7D8(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_21224E3247DC5261459B5E93D18EB8EB;// 0xD828(0x0200)
	unsigned char                                      UnknownData00[0x8];                                       // 0xDA28(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_D4A82C634C328915A22DC6B4CFEEF962; // 0xDA30(0x0270)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B31C0A1549B675A8E01DCDA62367C6C5;// 0xDCA0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_42F95B1845B0E453345F2F84DD39B630;// 0xDCF0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9E0ACA10433524CD3D8DF68ECA2A98D8;// 0xDD40(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2F1B07D746594D7705F636913738D1CB;// 0xDD90(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B7B9423D4956B6DF8660B1806FF168C7;// 0xDDE0(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_76C2F3AC4AE22CBED3845BB7DD9766CB;      // 0xDEC0(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_24AF42644209742880B3CFBD708713CD;// 0xDF30(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F9DAE33F4F9ECB624C5F49898F92A457;// 0xE010(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2666DD0E45489279511A868F3ABF62E7;// 0xE060(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_787D8C1F47A2AB2DECED10805786560F;// 0xE140(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FC2BE49047297400F1F1F4B8175A7B45;// 0xE220(0x0050)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9B528DEA4017EA21A743C6B0D62FF143;// 0xE270(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1FF507C748AE39C53F6D28BB57CA995A;// 0xE2B8(0x00D0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5B7C3C654A803D93CC1CDA9DF35DF5B2;// 0xE388(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_CB1BEA5944FD0F587E6F7EB7A174794F;// 0xE3D0(0x0200)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D2BA08674354C88081D13293F80F0564;// 0xE5D0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FF8617E34188BFB8810B3DA7FCC4C061;// 0xE6B0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5C9CBAF94E73494EA9463BB20D2A3C8F;// 0xE700(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B4D8517C42B2AE43B93FF19D341A7AFE;// 0xE750(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_D730273C49278AEC8DB95CB2A1B5FE55;// 0xE7A0(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B805FF104A34FF973493CAB595443318;// 0xE9A0(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9B62A7874946A0E1F956A89E98514E2A;// 0xE9F0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D1E649E747E131F1963BB9B495C9D81A;// 0xEAD0(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_B2D703424DFF3D4AF88A66877C782F21;// 0xEB20(0x0200)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_605676AF4E4EEED78F58CAA3CAAA34AB;// 0xED20(0x0200)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_16A8ECF4484530D2C4C7A1BCED5A58BE;// 0xEF20(0x0050)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_E9A238054F40EA57F693B8AD8AD92D19; // 0xEF70(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C256A5814C448444FE086BA7CFD03903;// 0xF1E0(0x0160)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_C3DEA9394314270B9CFF0D9BCDE8CF49; // 0xF340(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_57ADFEF348DD5367D1503FAFE6CE41C4;// 0xF5B0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4529F8C0436819B43F6F93AF264EF4FF;// 0xF710(0x0160)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_ED5FBC9243DB9BB43E2CBA81D6AF5100;// 0xF870(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C49A00BD42F2AFE65134C2BC953B43B4;// 0xF950(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B013E22419121B7B92D03B33BEC63A1;// 0xF998(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5FAA275488FCE05ACB61D88091EEBF9;// 0xF9E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_116069884AD09F30082899AC7D4DF193;// 0xFA28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CFECEE9497F1324C33EFAA7702DBBA0;// 0xFA70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62F55133423E9C2053CAA09A7CE81877;// 0xFAB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42C436BA4CFDA7B67B21D0A7F0F0CCFB;// 0xFB00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C906738944C90C1E5FD2959E58B0A530;// 0xFB48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37DAD723484CAF4506B71380789C3064;// 0xFB90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BFC5583466CED101024CDAD248900FA;// 0xFBD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BA637554FB2B960A3CDE19E0AAE05E1;// 0xFC20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5FB76784DA620876149CE8BFA1A7B36;// 0xFC68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1EC4EF954D80087025DF33A329AE49F2;// 0xFCB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBC7FAF64E7C454AFFF375B21E97BADB;// 0xFCF8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4A417BFA448F22ED84C83AA2F711A085;// 0xFD40(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4DF5DDC249CAACE1F5F734816DD2FD77;// 0xFE68(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6F8588454DD5507335676CB5D161798A;// 0xFEB0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_278E05F0479D098B747729AFA6F583FB;// 0xFF90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B523C0A4C23B435427CCDA0C69FB032;// 0xFFD8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_262A41684AF826E783061192A9F5C394;// 0x10088(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_657EABC84EDCD166D8A1438F3D7DB38D;// 0x100D0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A62D0F97438AB0DAF2D5579625CD401B;// 0x101F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FDFA632149E7323D13B5FD9428A42C48;// 0x10240(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C15078A4F88F2D846A04384785AE1B3;// 0x10288(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B2B5A0194E74CA635743C0ABE2045F99;// 0x102D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98B8AE694AE7EA26766CF69F398ECDE3;// 0x10318(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BC95D0C4A5CA7DAF9AF0882E07F2160;// 0x10360(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7C8155F4FFB3540B7AE689ED422E068;// 0x103A8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_29CF57364EB186A985A941A00C0E2666;// 0x103F0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A779425E43A7037E28ECF1B465F3D963;// 0x10428(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A79BE23A4D3B4C0DB90334A07B8F8DAB;// 0x10470(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BBF47D9F440E53D1EBD93F9B95086583;// 0x10598(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B821324E4507C9C2A78A1487232C7309;// 0x105E0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EDB04D304DF3B489E14964BD6ADC91BF;// 0x106B0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8889090543F820AC9BBE9D95671373D3;// 0x107D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B48D67846BE0B8993D118BF0401B8F9;// 0x10888(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30C71C90437C5593CB5BC29E693E8BB7;// 0x108D0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F39D35E464C0ACDDE7086957C24C214;// 0x10980(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BD29B1EB47540437C70B5A872461D821;// 0x109C8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3A43BB584C7FD6DCFA9959AF4E8C0D21;// 0x10AA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DEF606645F5E76704FE0FB8E1088958;// 0x10AF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C461689A434A1644DC1A988268CBF2A3;// 0x10B38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_176DE7604F47F97A838AC2B8BDE8AC97;// 0x10B80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19A26A544E49089A80A5AC81361C4DDF;// 0x10BC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D64047842128D0EDF12BE80DFCC9048;// 0x10C10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FB7E70FF474FE748C71BE99A7293D5C1;// 0x10C58(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7F62657D44BB0AE0FB00C4BF43B976B2;// 0x10D80(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_E31D11D348C730A0031C20B209F7B907;// 0x10DC8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7D37BCE24773CCDE0ABFC4A4488F06C9;// 0x10E00(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_422433EC40ED29F1A1F6C7835638527B;// 0x10E48(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EB11EFDE448F168B3EC3A39C956278C0;// 0x10F70(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DE52E98545163D8FF4E12F8A5682E592;// 0x11098(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9CC4EA14464E1CC9FDD7C6AC128DEDD7;// 0x11168(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D6830A8E46BE1D01011CC7A8BCF47605;// 0x111B0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_700F2BE343B9663B08F8BDA6B52A27E4;// 0x112D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CA8F9C344AEA53162615419E0729935F;// 0x11320(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_36E321B941E8B322B1E4ABA54622D04D;// 0x11400(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D504744E430AD7819348F0A7307A920C;// 0x11448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6007C8A3477EC17F8054B18DEFCF1196;// 0x11490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_224EDCBE4C8998791BE2C285DC94AFDE;// 0x114D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ACF2A9F84C93C954DBACEDA418CBAC7F;// 0x11520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C84C850646FEDBCD98421C9E68133AFE;// 0x11568(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC9577E8447D3726214D42847ABB7CF3;// 0x115B0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_16539DAA4FD0EF3FECC2B0BF8831ECA9;// 0x11660(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D415854F4AF84A67FD65C182D282A65D;// 0x11730(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A3FA371B4247FD5E8E4FDDA3786546AE;// 0x117E0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8E492C1640B23718A2108AB2A2415A7E;// 0x11828(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6537646E46B7E28C6A3BFEAA876BB8C6;// 0x11950(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB93C11B46DC8822DA179FA294A830EB;// 0x11998(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_09DFFEA5415165F92D40D6AF93972440;// 0x11A48(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_CC359708439409A6754B3F9EBAB736E1;// 0x11B70(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F9859A2E42D0EFF60ED210B79C8F83DC;// 0x11C90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E01EF50146A17815788368AF721A9906;// 0x11CD8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E537A04A437315727C0074AAEA5F73D1;// 0x11D88(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FAB3AE3C41A6ECB607CE708F27A2EA24;// 0x11DD0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C58FEEC94016E7D6950C9FBD7BF8EA67;// 0x11EB0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4C40A39F441484AE359C659BFDD0A987;// 0x11EF8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_83792EF84031E4A00BEC78A3C8736BC8;      // 0x11FD8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_693E6C64438454C16564D6B996FBF8D5;      // 0x12020(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_840FD7304DB3D2DDD9F5198A6222E00E;// 0x12090(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_521559F64D302D20B73302BE1DF8751C;      // 0x12170(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_30E6A3A34BDCC7AC720219B29ECD405B;// 0x121E0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1C01D76B47B0A82E5B9986AA2763FCD8;// 0x122C0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_364DF7254A8E080812E89894807AEF5F;// 0x123A0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8244B0FF4E1E06F5B1EF98BE7D916BA9;// 0x123F0(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0EC62AB644A4DBFD3B333AB4B468EF1D;// 0x12440(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F13283AB4597150DF73D1995375BCFD4;// 0x12520(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BF454E4349A73784CC5A13B75AD5B8E8;// 0x12570(0x00D0)
	class UCharacterMovementComponent*                 mCharacterMovementComponent;                              // 0x12640(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	struct FVector                                     mActorLocation;                                           // 0x12648(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         mMovementMode;                                            // 0x12654(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x12655(0x0003) MISSED OFFSET
	float                                              mDeltaTime;                                               // 0x12658(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mChangeIdleAnimation;                                     // 0x1265C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1265D(0x0003) MISSED OFFSET
